#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.root_bucket: Refreshing state... [id=root-amiblocked.io.website]
aws_s3_bucket.www_bucket: Refreshing state... [id=amiblocked.io.website]
aws_s3_bucket.terraform-state-storage-s3: Refreshing state... [id=amiblocked.io.tfstate]
aws_dynamodb_table.dynamodb-terraform-state-lock: Refreshing state... [id=example-iac-terraform-state-lock-dynamo]
aws_acm_certificate.default: Refreshing state... [id=arn:aws:acm:us-east-1:811340996907:certificate/e4bee502-483e-4de5-817a-855d40d961a7]
aws_s3_bucket_versioning.terraform-state-storage-s3: Refreshing state... [id=amiblocked.io.tfstate]
aws_s3_bucket_cors_configuration.www_bucket_cors: Refreshing state... [id=amiblocked.io.website]
aws_s3_bucket_website_configuration.www_bucket_website: Refreshing state... [id=amiblocked.io.website]
aws_s3_bucket_acl.www_bucket_acl: Refreshing state... [id=amiblocked.io.website,public-read]
aws_s3_bucket_website_configuration.root_bucket_website: Refreshing state... [id=root-amiblocked.io.website]
aws_s3_bucket_acl.root_bucket_acl: Refreshing state... [id=root-amiblocked.io.website,public-read]
aws_route53_record.default: Refreshing state... [id=Z05643233JO758YN920J2__59f760da3c95b52410a88bcd125496fa.amiblocked.io._CNAME]
aws_acm_certificate_validation.default: Refreshing state... [id=2022-05-28 20:07:29.745 +0000 UTC]
aws_cloudfront_distribution.root_s3_distribution: Refreshing state... [id=E3OFEB4VR1ZF1H]
aws_cloudfront_distribution.www_s3_distribution: Refreshing state... [id=E3967CGP251YI1]
aws_route53_record.root-a: Refreshing state... [id=Z05643233JO758YN920J2_amiblocked.io_A]
aws_route53_record.www-a: Refreshing state... [id=Z05643233JO758YN920J2_www.amiblocked.io_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket_cors_configuration.www_bucket_cors has been deleted
  - resource "aws_s3_bucket_cors_configuration" "www_bucket_cors" {
      - bucket = "amiblocked.io.website" -> null
      - id     = "amiblocked.io.website" -> null

      - cors_rule {
          - allowed_headers = [
              - "Authorization",
              - "Content-Length",
            ] -> null
          - allowed_methods = [
              - "GET",
              - "POST",
            ] -> null
          - allowed_origins = [
              - "https://www.amiblocked.io",
            ] -> null
          - expose_headers  = [] -> null
          - max_age_seconds = 3000 -> null
        }
    }

  # aws_s3_bucket_website_configuration.root_bucket_website has been deleted
  - resource "aws_s3_bucket_website_configuration" "root_bucket_website" {
      - bucket           = "root-amiblocked.io.website" -> null
      - id               = "root-amiblocked.io.website" -> null
      - website_domain   = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint = "root-amiblocked.io.website.s3-website-us-east-1.amazonaws.com" -> null

      - redirect_all_requests_to {
          - host_name = "www.amiblocked.io" -> null
        }
    }

  # aws_s3_bucket_website_configuration.www_bucket_website has been deleted
  - resource "aws_s3_bucket_website_configuration" "www_bucket_website" {
      - bucket           = "amiblocked.io.website" -> null
      - id               = "amiblocked.io.website" -> null
      - website_domain   = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint = "amiblocked.io.website.s3-website-us-east-1.amazonaws.com" -> null

      - error_document {
          - key = "error.html" -> null
        }

      - index_document {
          - suffix = "index.html" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket_cors_configuration.www_bucket_cors will be created
  + resource "aws_s3_bucket_cors_configuration" "www_bucket_cors" {
      + bucket = "amiblocked.io.website"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "Authorization",
              + "Content-Length",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
            ]
          + allowed_origins = [
              + "https://www.amiblocked.io",
            ]
          + expose_headers  = []
          + max_age_seconds = 3000
        }
    }

  # aws_s3_bucket_website_configuration.root_bucket_website will be created
  + resource "aws_s3_bucket_website_configuration" "root_bucket_website" {
      + bucket           = "root-amiblocked.io.website"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + redirect_all_requests_to {
          + host_name = "www.amiblocked.io"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

  # aws_s3_bucket_website_configuration.www_bucket_website will be created
  + resource "aws_s3_bucket_website_configuration" "www_bucket_website" {
      + bucket           = "amiblocked.io.website"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @superdug, Action: `pull_request`, Working Directory: ``, Workflow: `CI`*